# SlabShapeCreaseArrayIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeCreaseArrayIterator Class
Members See Also
---
An iterator to an array of creases used for Slab Shape Editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class SlabShapeCreaseArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class SlabShapeCreaseArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class SlabShapeCreaseArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SlabShapeCreaseArrayIterator
# See Also
SlabShapeCreaseArrayIterator Members
Autodesk.Revit.DB Namespace